juliendorra/esp32-smartdisplay-demo/src/main.cpp
    // Battery (Using Symbol)
    lv_obj_t *battery_label = lv_label_create(bar);
    lv_label_set_text(battery_label, LV_SYMBOL_BATTERY_FULL);
    lv_obj_align(battery_label, LV_ALIGN_RIGHT_MID, 0, 0);
}

void create_text_area(lv_obj_t *parent)
{
    lv_obj_t *area = lv_obj_create(parent);
    lv_obj_remove_style_all(area);
    lv_obj_add_style(area, &style_text_area, 0);
    lv_obj_set_size(area, SCREEN_WIDTH, TEXT_AREA_HEIGHT);
    lv_obj_align(area, LV_ALIGN_TOP_MID, 0, STATUS_BAR_HEIGHT);
    lv_obj_remove_flag(area, LV_OBJ_FLAG_SCROLLABLE);

    text_content_label = lv_label_create(area);
    lv_label_set_text(text_content_label, "");
    lv_obj_set_width(text_content_label, lv_pct(100));
    lv_label_set_long_mode(text_content_label, LV_LABEL_LONG_WRAP);
    lv_obj_set_style_text_color(text_content_label, COLOR_TEXT_AREA_TEXT, 0);
    lv_obj_set_style_text_font(text_content_label, &lv_font_montserrat_20, 0); // Example font size
    lv_obj_align(text_content_label, LV_ALIGN_TOP_LEFT, 0, 0);

    // Cursor
    text_cursor = lv_obj_create(area);
    lv_obj_set_size(text_cursor, 2, 20); // Match font size
    lv_obj_set_style_bg_color(text_cursor, COLOR_CURSOR, 0);
    lv_obj_set_style_bg_opa(text_cursor, LV_OPA_COVER, 0);
    lv_obj_set_style_border_width(text_cursor, 0, 0);
    lv_obj_add_flag(text_cursor, LV_OBJ_FLAG_HIDDEN); // Start hidden
    // Position update needed in update_text_area_display
}

void create_keyboard(lv_obj_t *parent)
{
    lv_obj_t *kb_area = lv_obj_create(parent);
    lv_obj_remove_style_all(kb_area);
    lv_obj_add_style(kb_area, &style_keyboard_area, 0);
    lv_obj_set_size(kb_area, SCREEN_WIDTH, SCREEN_HEIGHT - STATUS_BAR_HEIGHT - TEXT_AREA_HEIGHT);
    lv_obj_align(kb_area, LV_ALIGN_BOTTOM_MID, 0, 0);
    lv_obj_remove_flag(kb_area, LV_OBJ_FLAG_SCROLLABLE);

    lv_coord_t kb_inner_width = SCREEN_WIDTH - 2 * KEYBOARD_PADDING;
    lv_coord_t current_y = 0;

    // --- Top Row ---
    lv_obj_t *top_row_cont = lv_obj_create(kb_area);
    lv_obj_remove_style_all(top_row_cont);
    lv_obj_set_size(top_row_cont, kb_inner_width, TOP_ROW_HEIGHT);
    lv_obj_align(top_row_cont, LV_ALIGN_TOP_MID, 0, 0);
    lv_obj_set_style_pad_all(top_row_cont, 0, 0);

    lv_obj_t *clear_btn = lv_button_create(top_row_cont);
    lv_obj_remove_style_all(clear_btn);
    lv_obj_add_style(clear_btn, &style_key, 0);
    lv_obj_add_style(clear_btn, &style_key_pressed, LV_STATE_PRESSED);
    lv_obj_set_size(clear_btn, ACTION_BTN_WIDTH, TOP_ROW_HEIGHT);
    lv_obj_align(clear_btn, LV_ALIGN_LEFT_MID, 0, 0);
    lv_obj_add_event_cb(clear_btn, action_button_event_cb, LV_EVENT_CLICKED, (void *)"clear");
    lv_obj_t *clear_label = lv_label_create(clear_btn);
    lv_label_set_text(clear_label, "clear");
    lv_obj_center(clear_label);

    lv_obj_t *accept_btn = lv_button_create(top_row_cont);
    lv_obj_remove_style_all(accept_btn);
    lv_obj_add_style(accept_btn, &style_key, 0);
    lv_obj_add_style(accept_btn, &style_key_pressed, LV_STATE_PRESSED);
    lv_obj_set_size(accept_btn, ACTION_BTN_WIDTH, TOP_ROW_HEIGHT);
    lv_obj_align(accept_btn, LV_ALIGN_RIGHT_MID, 0, 0);
    lv_obj_add_event_cb(accept_btn, action_button_event_cb, LV_EVENT_CLICKED, (void *)"accept");
    lv_obj_t *accept_label = lv_label_create(accept_btn);
    lv_label_set_text(accept_label, "accept");
    lv_obj_center(accept_label);

    lv_obj_t *input_cont = lv_obj_create(top_row_cont);
    lv_obj_remove_style_all(input_cont);
    lv_obj_add_style(input_cont, &style_input_cont, 0);
    lv_coord_t input_width = kb_inner_width - 2 * ACTION_BTN_WIDTH - 2 * TOP_ROW_H_GAP;
    lv_obj_set_size(input_cont, input_width, TOP_ROW_HEIGHT);
    lv_obj_align(input_cont, LV_ALIGN_CENTER, 0, 0);

    input_text_label = lv_label_create(input_cont);
    lv_label_set_text(input_text_label, "");
    lv_obj_set_style_text_color(input_text_label, COLOR_INPUT_TEXT, 0);
    lv_obj_set_style_text_font(input_text_label, &lv_font_montserrat_18, 0); // Example font size
    lv_obj_align(input_text_label, LV_ALIGN_LEFT_MID, 0, 0);                 // Align left for text

    input_cursor = lv_obj_create(input_cont);
    lv_obj_set_size(input_cursor, 2, 18); // Match font size
    lv_obj_set_style_bg_color(input_cursor, COLOR_CURSOR_INPUT, 0);
    lv_obj_set_style_bg_opa(input_cursor, LV_OPA_COVER, 0);
    lv_obj_set_style_border_width(input_cursor, 0, 0);
    lv_obj_add_flag(input_cursor, LV_OBJ_FLAG_HIDDEN); // Start hidden
    // Position update needed in update_input_display

    current_y += TOP_ROW_HEIGHT + KEY_ROW_V_GAP;

    // --- Blob Key Rows ---
    const char *key_letters[] = {
        "bac", "fdg", "jek", "mhp",
        "qiv", "wlx", "ynz", ".o?",
        ",r-", "@s'", ":t\"", "/u!"};
    int key_index = 0;
    lv_coord_t blob_key_width = (kb_inner_width - 3 * KEY_H_GAP) / 4;
    lv_coord_t blob_key_height = (SCREEN_HEIGHT - STATUS_BAR_HEIGHT - TEXT_AREA_HEIGHT - KEYBOARD_PADDING * 2 - TOP_ROW_HEIGHT - BOTTOM_ROW_HEIGHT - 3 * KEY_ROW_V_GAP) / 3; // Calculate height

    for (int row = 0; row < 3; row++)
    {
        lv_obj_t *row_cont = lv_obj_create(kb_area);
        lv_obj_remove_style_all(row_cont);
        lv_obj_set_size(row_cont, kb_inner_width, blob_key_height);
        lv_obj_align(row_cont, LV_ALIGN_TOP_LEFT, 0, current_y);
        lv_obj_set_style_pad_all(row_cont, 0, 0);

        for (int col = 0; col < 4; col++)
        {
            lv_obj_t *key = create_blob_key(row_cont, key_letters[key_index++]);
            lv_obj_set_size(key, blob_key_width, blob_key_height);
            lv_obj_align(key, LV_ALIGN_LEFT_MID, col * (blob_key_width + KEY_H_GAP), 0);
        }
        current_y += blob_key_height + KEY_ROW_V_GAP;
    }

    // --- Bottom Row ---
    lv_obj_t *bottom_row_cont = lv_obj_create(kb_area);
    lv_obj_remove_style_all(bottom_row_cont);
    lv_obj_set_size(bottom_row_cont, kb_inner_width, BOTTOM_ROW_HEIGHT);
    lv_obj_align(bottom_row_cont, LV_ALIGN_TOP_LEFT, 0, current_y + 4); // +4 margin from CSS
    lv_obj_set_style_pad_all(bottom_row_cont, 0, 0);

    lv_obj_t *shift_btn = lv_button_create(bottom_row_cont);
    lv_obj_remove_style_all(shift_btn);
    lv_obj_add_style(shift_btn, &style_key, 0);
    lv_obj_add_style(shift_btn, &style_key_pressed, LV_STATE_PRESSED);
    lv_obj_set_size(shift_btn, ACTION_BTN_WIDTH, BOTTOM_ROW_HEIGHT);
    lv_obj_align(shift_btn, LV_ALIGN_LEFT_MID, 0, 0);
    // lv_obj_add_event_cb(shift_btn, action_button_event_cb, LV_EVENT_CLICKED, (void*)"shift"); // Add handler later
    lv_obj_t *shift_label = lv_label_create(shift_btn);
    lv_label_set_text(shift_label, "shift");
    lv_obj_center(shift_label);

    lv_obj_t *numbers_btn = lv_button_create(bottom_row_cont);
    lv_obj_remove_style_all(numbers_btn);
    lv_obj_add_style(numbers_btn, &style_key, 0);
    lv_obj_add_style(numbers_btn, &style_key_pressed, LV_STATE_PRESSED);
    lv_obj_set_size(numbers_btn, ACTION_BTN_WIDTH, BOTTOM_ROW_HEIGHT);
    lv_obj_align(numbers_btn, LV_ALIGN_RIGHT_MID, 0, 0);
    // lv_obj_add_event_cb(numbers_btn, action_button_event_cb, LV_EVENT_CLICKED, (void*)"numbers"); // Add handler later
    lv_obj_t *numbers_label = lv_label_create(numbers_btn);
    lv_label_set_text(numbers_label, "123");
    lv_obj_center(numbers_label);

